Repository: BravoBaldo/Translations
Catalog: Yocto/Official/Yocto_OmegaT/Yocto_OmegaT-level2.tmx
Source language: en_us
Languages: it_it

source: Toaster has an API that allows remote management applications to directly query the state of the Toaster server and its builds in a machine-to-machine manner. This API uses the :wikipedia:`REST <Representational_state_transfer>` interface and the transfer of JSON files. For example, you might monitor a build inside a container through well supported known HTTP ports in order to easily access a Toaster server inside the container. In this example, when you use this direct JSON API, you avoid having web page parsing against the display the user sees.
it_it: Toaster dispone di un'API che consente alle applicazioni di gestione remota di interrogare direttamente lo stato del server Toaster e delle sue build in modalità machine-to-machine. Questa API utilizza l'interfaccia :wikipedia:`REST <Representational_state_transfer>` e il trasferimento di file JSON. Ad esempio, è possibile monitorare una build all'interno di un container tramite porte HTTP note e supportate per accedere facilmente a un server Toaster all'interno del container. In questo esempio, utilizzando questa API JSON diretta, si evita di dover analizzare la pagina web rispetto alla visualizzazione mostrata all'utente.

source: Toaster is a web interface to the Yocto Project's :term:`OpenEmbedded Build System`. The interface enables you to configure and run your builds. Information about builds is collected and stored in a database. You can use Toaster to configure and start builds on multiple remote build servers.
it_it: Toaster è un'interfaccia web per il :term:`OpenEmbedded Build System` di Yocto Project. L'interfaccia consente di configurare ed eseguire le build. Le informazioni relative alle build vengono raccolte e memorizzate in un database. È possibile utilizzare Toaster per configurare e avviare build su più server di build remoti.

source: Toaster is built on the `Django framework <https://www.djangoproject.com/>`__. Django provides an administration interface you can use to edit Toaster configuration parameters.
it_it: Toaster è basato sul `framework Django <https://www.djangoproject.com/>`__. Django fornisce un'interfaccia di amministrazione utilizzabile per modificare i parametri di configurazione di Toaster.

source: Toaster requires extra Python dependencies in order to run. A Toaster requirements file named ``toaster-requirements.txt`` defines the Python dependencies. The requirements file is located in the ``bitbake`` directory, which is located in the root directory of the :term:`Source Directory` (e.g. ``poky/bitbake/toaster-requirements.txt``). The dependencies appear in a ``pip``, install-compatible format.
it_it: Toaster richiede dipendenze Python aggiuntive per funzionare. Un file di requisiti di Toaster denominato ``toaster-requirements.txt`` definisce le dipendenze Python. Il file di requisiti si trova nella directory ``bitbake``, che si trova nella directory principale della :term:`Source Directory` (ad esempio ``poky/bitbake/toaster-requirements.txt``). Le dipendenze vengono visualizzate in un formato compatibile con ``pip``.

source: Toaster uses settings that are based on the database to configure the building tasks. The ``checksettings`` command verifies that the database settings are valid in the sense that they have the minimal information needed to start a build.
it_it: Toaster utilizza impostazioni basate sul database per configurare i task di compilazione. Il comando ``checksettings`` verifica che le impostazioni del database siano valide, ovvero che contengano le informazioni minime necessarie per avviare una build.

source: Toaster web interface testing
it_it: Test dell'interfaccia web di Toaster

source: Today, BitBake is the primary build tool of OpenEmbedded based projects, such as the Yocto Project.
it_it: Oggi, BitBake è lo strumento di compilazione principale dei progetti basati su OpenEmbedded, come lo Yocto Project.

source: Tools for Hardening Your Image
it_it: Tool per Rafforzare la Sicurezza dell'Immagine

source: Top-Level Core Components
it_it: Componenti Principali di Primo Livello

source: Tracing Block I/O via 'ftrace'
it_it: Tracing dell'I/O a Blocchi tramite 'ftrace'

source: Tracking the Status of Patches
it_it: Monitoraggio dello Stato delle Patch

source: Transfer the ``.sh`` file from the build host to the machine that does not meet the Git, tar, or Python (or gcc) requirements.
it_it: Trasferire il file ``.sh`` dall'host di compilazione alla macchina che non soddisfa i requisiti di Git, tar o Python (o gcc).

source: Transitioning to a custom environment for systems development
it_it: Transizione a un ambiente personalizzato per lo sviluppo di sistemi

source: Troubleshooting Email Issues
it_it: Risoluzione dei Problemi Relativi alle Email

source: Try connecting to the target through SSH and see what happens::
it_it: Provare a connettersi al target tramite SSH e verificare cosa succede::

source: Tuning files are found in the ``meta/conf/machine/include`` directory within :term:`OpenEmbedded-Core (OE-Core)`. For example, many ``tune-*`` files (e.g. ``tune-arm1136jf-s.inc``, ``tune-1586-nlp.inc``, and so forth) reside in the ``meta/conf/machine/include`` directory.
it_it: I file di tuning si trovano nella directory ``meta/conf/machine/include`` all'interno di :term:`OpenEmbedded-Core (OE-Core)`. Ad esempio, molti file ``tune-*`` (come ``tune-arm1136jf-s.inc``, ``tune-1586-nlp.inc``, e così via) si trovano nella directory ``meta/conf/machine/include``.

source: Two generic IA platforms (``genericx86`` and ``genericx86-64``)
it_it: Due piattaforme IA generiche (``genericx86`` e ``genericx86-64``)

source: Two types of output exist. One type is just about creating a directory in :term:`WORKDIR`. A good example is the output of either :ref:`ref-tasks-install` or :ref:`ref-tasks-package`. The other type of output occurs when a set of data is merged into a shared directory tree such as the sysroot.
it_it: Esistono due tipi di output. Un tipo consiste semplicemente nella creazione di una directory in :term:`WORKDIR`. Un buon esempio è l'output di :ref:`ref-tasks-install` o :ref:`ref-tasks-package`. L'altro tipo di output si verifica quando un insieme di dati viene unito in una struttura di directory condivisa [shared] come la sysroot.

source: Tying a layer source into Toaster is convenient when you have many custom layers that need to be built on a regular basis by a community of developers. In fact, Toaster comes pre-configured with the OpenEmbedded Metadata Index.
it_it: Integrare una sorgente di layer in Toaster è utile quando si hanno molti layer personalizzati che devono essere creati regolarmente da una community di sviluppatori. Infatti, Toaster è preconfigurato con l'OpenEmbedded Metadata Index.

source: Tying it Together
it_it: Unire il Tutto

source: Ubuntu and Debian
it_it: Ubuntu e Debian

source: Understanding Fixture File Format
it_it: Comprensione del Formato dei File di Fixture

source: Understanding Your Layers
it_it: Comprensione dei Layer

source: Understanding and Creating Layers
it_it: Comprendere e Creare i Layer

source: Unlike some distro recipes (e.g. Debian), OpenEmbedded recipes that produce packages that depend on tunings through use of the :term:`RDEPENDS` and :term:`TUNE_PKGARCH` variables, should never be configured for all architectures using :ref:`ref-classes-allarch`. This is the case even if the recipes do not produce architecture-specific output.
it_it: A differenza di alcune ricette di distribuzione (ad esempio Debian), le ricette di OpenEmbedded che producono pacchetti dipendenti da ottimizzazioni tramite l'uso delle variabili :term:`RDEPENDS` e :term:`TUNE_PKGARCH` non devono mai essere configurate per tutte le architetture utilizzando :ref:`ref-classes-allarch`. Questo accade anche se le ricette non producono output specifici per un'architettura.

source: Upstream Project Releases
it_it: Versioni dei Progetti Upstream

source: Upstream project releases exist anywhere in the form of an archived file (e.g. tarball or zip file). These files correspond to individual recipes. For example, the figure uses specific releases each for BusyBox, Qt, and Dbus. An archive file can be for any released product that can be built using a recipe.
it_it: Le versioni dei progetti upstream sono disponibili ovunque sotto forma di file compressi (ad esempio, file tarball o zip). Questi file corrispondono a singole ricette. Ad esempio, la figura utilizza versioni specifiche per BusyBox, Qt e Dbus. Un file di archivio può essere relativo a qualsiasi prodotto rilasciato che può essere compilato utilizzando una ricetta.

source: Use :ref:`bitbake-setup settings list <bitbake:ref-bbsetup-command-settings>` to get an overview of the settings.
it_it: Usare :ref:`bitbake-setup settings list <bitbake:ref-bbsetup-command-settings>` per ottenere una panoramica delle impostazioni.

source: Use :term:`BBCLASSEXTEND` instead of creating separate recipes such as ``-native`` and ``-nativesdk`` ones, whenever possible. This avoids having to maintain multiple recipe files at the same time.
it_it: Utilizzare :term:`BBCLASSEXTEND` invece di creare ricette separate come ``-native`` e ``-nativesdk``, quando possibile. Questo evita di dover gestire più file di ricetta contemporaneamente.

source: Use Board Support Package (BSP) layers from silicon vendors when possible.
it_it: Utilizzare i layer BSP (Board Support Package) dei produttori di semiconduttori quando possibile.

source: Use the Administration Interface
it_it: Utilizzare l'Interfaccia di Amministrazione

source: Use the Fixture Feature
it_it: Utilizzo della Funzionalità Fixture

source: Use the Mysql database server.
it_it: Utilizzare il server di database MySQL.

source: Use the following command to set up Toaster without a build server::
it_it: Utilizzare il seguente comando per configurare Toaster senza un server di build::

source: Use the following general steps to submit a bug:
it_it: Seguire i seguenti passaggi generali per segnalare un bug:

source: Use the following line in your :ref:`structure-build-conf-local.conf` file or in your custom distro :term:`configuration file` to enable the security compiler and linker flags for your build::
it_it: Utilizzare la seguente riga nel file :ref:`structure-build-conf-local.conf` o nel :term:`configuration file` della propria distribuzione per abilitare i flag di sicurezza del compilatore e del linker per la build::

source: Use the following steps to build your image. The build process creates an entire Linux distribution, including the toolchain, from source.
it_it: Seguire i passaggi seguenti per compilare l'immagine. Il processo di compilazione (build) crea un'intera distribuzione Linux, inclusa la toolchain, a partire dai sorgenti.

source: Use these steps to create a BSP layer:
it_it: Seguire questi passaggi per creare un layer BSP:

source: Used by the alternatives system to create default link locations for duplicated commands. You can use the variable to create a single default location for all duplicated commands regardless of the command name or package, a default for specific duplicated commands regardless of the package, or a default for specific commands tied to particular packages. Here are the available syntax forms::
it_it: Utilizzato dal sistema di alternative per creare path di collegamento di default per i comandi duplicati. È possibile utilizzare la variabile per creare una singola posizione di default per tutti i comandi duplicati, indipendentemente dal nome del comando o dal pacchetto, una posizione di default per specifici comandi duplicati, indipendentemente dal pacchetto, oppure una posizione di default per specifici comandi associati a determinati pacchetti. Ecco le forme di sintassi disponibili::

source: Used by the alternatives system to create default priorities for duplicated commands. You can use the variable to create a single default regardless of the command name or package, a default for specific duplicated commands regardless of the package, or a default for specific commands tied to particular packages. Here are the available syntax forms::
it_it: Utilizzato dal sistema di alternative per creare priorità predefinite per i comandi duplicati. È possibile utilizzare la variabile per creare un singolo valore di default indipendentemente dal nome del comando o dal pacchetto, un valore di default per specifici comandi duplicati indipendentemente dal pacchetto, oppure un valore di default per specifici comandi associati a determinati pacchetti. Ecco le forme di sintassi disponibili::

source: Used by the alternatives system to map duplicated commands to actual locations. For example, if the ``bracket`` command provided by the ``busybox`` package is duplicated through another package, you must use the :term:`ALTERNATIVE_LINK_NAME` variable to specify the actual location::
it_it: Utilizzata dal sistema di alternative per mappare i comandi duplicati alle posizioni effettive. Ad esempio, se il comando ``bracket`` fornito dal pacchetto ``busybox`` è duplicato in un altro pacchetto, è necessario utilizzare la variabile :term:`ALTERNATIVE_LINK_NAME` per specificare il percorso effettivo::

source: Useful Commands
it_it: Comandi Utili

source: User Configuration
it_it: Configurazione Utente

source: User configuration helps define the build. Through user configuration, you can tell BitBake the target architecture for which you are building the image, where to store downloaded source, and other build properties.
it_it: La configurazione utente aiuta a definire la build. Tramite la configurazione utente, è possibile indicare a BitBake l'architettura di destinazione [target] per la quale si sta creando l'immagine, la posizione in cui archiviare il codice sorgente scaricato e altre proprietà della build.

source: Using Dynamic Tracepoints
it_it: Utilizzo di Tracepoint Dinamici

source: Using Git to Send Patches
it_it: Utilizzo di Git per Inviare le Patch

source: Using Scripts to Push a Change Upstream and Request a Pull
it_it: Uso di Script per il Push di una Modifica Upstream e il Pull Request

source: Using ``patchtest`` in this manner provides a final check for the overall quality of your changes before they are submitted for review by the maintainers.
it_it: L'utilizzo di ``patchtest`` in questo modo fornisce un controllo finale sulla qualità complessiva delle modifiche prima che vengano inviate per la revisione da parte dei manutentori.

source: Using ``perf script`` we can see each ``do_fork`` event that fired::
it_it: Usando ``perf script`` possiamo vedere ogni evento ``do_fork`` che si è attivato::

source: Using a :term:`buildtools` tarball by following the :ref:`system-requirements-buildtools` section below.
it_it: Utilizzando un tarball :term:`buildtools` seguendo la sezione :ref:`system-requirements-buildtools` qui di seguito.

source: Using blktrace Remotely
it_it: Utilizzo di blktrace da Remoto

source: Using perf to do Basic Profiling
it_it: Utilizzo di perf per la Profilazione di Base

source: Using perf to do Basic Tracing
it_it: Utilizzo di perf per il Tracing di Base

source: Using the Toaster Web Interface
it_it: Utilizzo dell'Interfaccia Web di Toaster

source: Using the Yocto Project is fairly easy, *until something goes wrong*. Without an understanding of how the build process works, you'll find yourself trying to troubleshoot "a black box". Here are a few items that new users wished they had known before embarking on their first build with Yocto Project. Feel free to contact us with other suggestions.
it_it: L'utilizzo di Yocto Project è relativamente semplice, *fino a quando non si verifica un problema*. Senza una comprensione approfondita del funzionamento del processo di compilazione, si rischierebbe di dover effettuare la risoluzione dei problemi alla cieca, come davanti a "una scatola nera [black box]". Di seguito vengono riportati alcuni elementi che gli utenti esperti avrebbero voluto conoscere prima di intraprendere la loro prima compilazione con Yocto Project. È possibile inviare feedback per proporre ulteriori suggerimenti.

source: Using the ``bitbake-setup`` command-line utility (see :doc:`Setting Up The Environment With bitbake-setup <bitbake:bitbake-user-manual/bitbake-user-manual-environment-setup>`).
it_it: Utilizzando l'utilità da riga di comando ``bitbake-setup`` (:doc:`Setting Up The Environment With bitbake-setup <bitbake:bitbake-user-manual/bitbake-user-manual-environment-setup>`).

source: Using the ``bitbake-setup`` command-line utility from :term:`BitBake`. Follow:
it_it: Utilizzando l'utilità da riga di comando ``bitbake-setup`` di :term:`BitBake`. Seguire le istruzioni riportate in:

source: Using the ``git send-email`` command is the only error-proof way of sending your patches using email since there is no risk of compromising whitespace in the body of the message, which can occur when you use your own mail client. It will also properly include your patches as *inline attachments*, which is not easy to do with standard e-mail clients without breaking lines. If you used your regular e-mail client and shared your patches as regular attachments, reviewers wouldn't be able to quote specific sections of your changes and make comments about them.
it_it: L'utilizzo del comando ``git send-email`` è l'unico modo sicuro per inviare patch via email, poiché elimina il rischio di compromettere la formattazione degli spazi bianchi nel corpo del messaggio, cosa che può accadere utilizzando il proprio client di posta. Inoltre, includerà correttamente le patch come *inline attachments*, cosa non facile da fare con i client di posta elettronica standard senza mandare a capo il testo. Utilizzando il normale client di posta elettronica e condividendo le patch come allegati, i revisori non sarebbero in grado di citare sezioni specifiche delle modifiche e di commentarle.

source: Using the call graph view, we can actually see not only which functions took the most time, but we can also see a summary of how those functions were called and learn something about how the program interacts with the kernel in the process.
it_it: Utilizzando la visualizzazione del grafico delle chiamate, possiamo vedere non solo quali funzioni hanno impiegato più tempo, ma anche un riepilogo di come sono state chiamate e possiamo imparare qualcosa su come il programma interagisce con il kernel.

source: Using these scripts correctly formats the requests without introducing any whitespace or HTML formatting. The maintainer that receives your patches either directly or through the mailing list needs to be able to save and apply them directly from your emails. Using these scripts is the preferred method for sending patches.
it_it: L'utilizzo di questi script formatta correttamente le richieste senza introdurre spazi bianchi o formattazione HTML. Il manutentore che riceve le patch, direttamente o tramite la mailing list, deve essere in grado di salvarle e applicarle direttamente dalle e-mail. Questo è il metodo preferito per l'invio delle patch.

source: Validating Patches with Patchtest
it_it: Validazione delle Patch con Patchtest

source: Variable Formatting
it_it: Formattazione delle Variabili

source: Variable assignment should include a space around each side of the operator, e.g. ``FOO = "bar"``, not ``FOO="bar"``.
it_it: L'assegnazione di una variabile deve includere uno spazio attorno all'operatore, ad esempio ``FOO = "bar"``, non ``FOO="bar"``.

source: Variables Glossary
it_it: Glossario delle Variabili

source: Various features such as ``multilib``, sub architectures (e.g. ``x32``, ``poky-tiny``, ``musl``, ``no-x11`` and so forth), ``bitbake-selftest``, and ``oe-selftest`` are tested as part of the QA process of a release. Complete testing and validation for a release takes the Autobuilder workers several hours.
it_it: Varie funzionalità, come ``multilib``, le sottoarchitetture (ad esempio ``x32``, ``poky-tiny``, ``musl``, ``no-x11`` e così via), ``bitbake-selftest`` e ``oe-selftest``, vengono testate come parte del processo di controllo qualità di una release. Il test e la validazione completi di una release richiedono diverse ore ai worker di Autobuilder.

source: Verify that your installation is successful by showing the version of GPG:
it_it: Verificare che l'installazione sia andata a buon fine controllando la versione di GPG:

source: Verifying Signed Shared State Artifacts
it_it: Verifica degli Artefatti Firmati dello Shared State

source: Verifying the shared state artifacts with your **public key** when re-using them.
it_it: Verificare gli artefatti di stato condivisi con la propria **chiave pubblica** quando si riutilizzano.

source: Version 5.0 ("Scarthgap"), released in April 2024 and supported until April 2028.
it_it: Versione 5.0 ("Scarthgap"), rilasciata ad aprile 2024 e supportata fino ad aprile 2028.

source: Version 6.0 ("Wrynose"), released in May 2026 and supported until April 2030.
it_it: Versione 6.0 ("Wrynose"), rilasciata a maggio 2026 e supportata fino ad aprile 2030.

source: Version Number Changes
it_it: Modifiche al Numero di Versione

source: Version Policy
it_it: Politica sulle Versioni

source: Version updates which follow an upstream stable series or LTS that aligns with the original release (based on compatibility). See :ref:`ref-manual/release-process:stable point release upgrades` for details.
it_it: Aggiornamenti di versione che seguono una serie stabile o LTS upstream allineata alla release originale (in base alla compatibilità). Per maggiori dettagli, consultare :ref:`ref-manual/release-process:stable point release upgrades`.

source: Vulnerabilities in OpenEmbedded-Core (OE-Core)
it_it: Vulnerabilità in OpenEmbedded-Core (OE-Core)

source: Vulnerability check at build time
it_it: Verifica delle vulnerabilità in fase di build

source: WIC image creation testing
it_it: Test della creazione di immagini con WIC

source: We also need to acknowledge that many of our developers are used to this mailing list workflow and have worked with it for years, with tools and processes built around it. Changing away from this would result in a loss of key people from the project, which would again be to its detriment.
it_it: Dobbiamo anche riconoscere che molti dei nostri sviluppatori sono abituati a questo flusso di lavoro tramite mailing list e lo utilizzano da anni, con strumenti e processi creati appositamente per questo scopo. Abbandonare questo sistema comporterebbe la perdita di persone chiave dal progetto, il che sarebbe a sua volta dannoso.

source: We can also use the system-wide ``-a`` switch to do system-wide tracing. Here we'll trace a couple of scheduler events::
it_it: Possiamo anche utilizzare l'opzione ``-a`` a livello di sistema per eseguire il tracciamento a livello di sistema. Qui tracceremo un paio di eventi dello scheduler::

source: We can get a list of the available events that can be used to profile a workload via ``perf list``::
it_it: Possiamo ottenere un elenco degli eventi disponibili che possono essere utilizzati per profilare un carico di lavoro tramite ``perf list``::

source: We can however replace the print statements in the generated function bodies with whatever we want, and thereby make it infinitely more useful.
it_it: Possiamo tuttavia sostituire le istruzioni print nei corpi delle funzioni generate con qualsiasi cosa desideriamo, rendendole così infinitamente più utili.

source: We can list all dynamic tracepoints currently in existence::
it_it: Possiamo elencare tutti i tracepoint dinamici attualmente esistenti::

source: We can look at the raw output using ``perf script`` with no arguments::
it_it: Possiamo visualizzare l'output grezzo utilizzando ``perf script`` senza argomenti::
